Revit 2027 API
UnitUtils.ConvertFromInternalUnits Method
 Converts a value from Revit's internal units to a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double ConvertFromInternalUnits(
	double value,
	ForgeTypeId unitTypeId
)
Public Shared Function ConvertFromInternalUnits (
	value As Double,
	unitTypeId As ForgeTypeId
) As Double
public:
static double ConvertFromInternalUnits(
	double value,
	ForgeTypeId^ unitTypeId
)
static member ConvertFromInternalUnits :
        value : float *
        unitTypeId : ForgeTypeId -> float
Parameters
value Double
 The value to convert.
unitTypeId ForgeTypeId
 Identifier of the desired unit.
Return Value
Double
 The converted value.
Exceptions
Exception | Condition
ArgumentException |  The given value for value is not finite -or- unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace